#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bund-dev/api-gateway/runs/run-hE44YsJ5QhHCXvxF

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.polizei_brandenburg_api_bund_dev_gh: Refreshing state... [id=polizei-brandenburg-api]
github_repository.apis_api_bund_dev_gh: Refreshing state... [id=apis]
github_repository.bundestag_api_bund_dev_gh: Refreshing state... [id=bundestag-api]
github_repository.interpol_api_bund_dev_gh: Refreshing state... [id=interpol-api]
github_repository.bundesrat_api_bund_dev_gh: Refreshing state... [id=bundesrat-api]
module.dwd_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bc12ea70-9284-4c49-ae80-ed4ec19895ed]
module.polizei_brandenburg_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/55b90fc6-b7ad-4c8d-a595-378df898645d]
module.zoll_bmf_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/0f2c2216-a361-4025-815e-1de9b05f17d4]
aws_elastic_beanstalk_application.elasticapp: Refreshing state... [id=strukturen-dev]
module.bundesrat_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bd620c4e-04b3-4c4e-bb0b-6cb7fb33b90e]
module.lebensmittelwarnung_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/98cf242a-7cee-4406-8e79-0e72f9606788]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=aokp8p1hm1]
aws_elastic_beanstalk_environment.beanstalkappenv: Refreshing state... [id=e-qnmriqrttj]
module.risikogebiete_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=t9a6cgwja8]
module.strahlenschutz_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=l4cm8bnava]
module.nina_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=6288qu3mta]
module.umweltbundesamt_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/b5b3067f-a50b-436a-b5b8-0fbf2d987127]
module.strahlenschutz_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/3beac05b-d4be-41d0-b611-126dc6a8606b]
module.risikogebiete_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/32c4c4e1-0468-42e8-a515-bf2db193b265]
module.nina_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/a96fd365-ea6c-475f-adfd-a7c476ce661e]
module.interpol_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/83a630b9-8205-4f04-99e0-cd45c4e119af]
module.interpol_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=bmjjia2rw5]
module.bundestag_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=3wx2npn2lc]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=mh34qq9035]
module.zoll_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=v46q8f816g]
module.bundesrat_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=001mcc9zz1]
module.bundestag_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bce050b2-d69a-49b2-8ab3-b560aa9211dd]
module.zoll_bmf_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=11frz7182m]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=3p9s6lb39i]
module.smard_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=7ho9gnokrf]
module.zoll_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/b8ca3a4d-c282-4265-8a7e-8ebf9e767b0f]
module.smard_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/f34a8fad-4235-4567-806b-4c6f352e6046]
module.dwd_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=t3cfhiw784]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.dwd_api_proxy.aws_route53_record.api_domain["dwd.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__2798659d161d4b61314abc34609e58c8.dwd.api.proxy.bund.dev._CNAME]
module.polizei_brandenburg_api_proxy.aws_route53_record.api_domain["polizei.brandenburg.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__2528ea8f3dd4f0d1b9154b6ab31db6d0.polizei.brandenburg.api.proxy.bund.dev._CNAME]
module.risikogebiete_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.bundesrat_api_proxy.aws_route53_record.api_domain["bundesrat.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__44b46bb2299fc4f34348708c8cac8fa9.bundesrat.api.proxy.bund.dev._CNAME]
module.zoll_bmf_api_proxy.aws_route53_record.api_domain["zoll-bmf.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__8179d776087dcf9af8e8a23941f3653c.zoll-bmf.api.proxy.bund.dev._CNAME]
module.nina_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.strahlenschutz_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.lebensmittelwarnung_api_proxy.aws_route53_record.api_domain["lebensmittelwarnung.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__3ddc1f3c489abd589a1fee8187f2be60.lebensmittelwarnung.api.proxy.bund.dev._CNAME]
module.interpol_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.bundestag_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
aws_route53_record.lebensmittelwarnung_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_lebensmittelwarnung.api_CNAME]
aws_route53_record.apis_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_api_CNAME]
aws_route53_record.bundesrat_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundesrat.api_CNAME]
aws_route53_record.polizei_brandenburg_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_polizei.brandenburg.api_CNAME]
aws_route53_record.mudab_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_mudab.api_CNAME]
aws_route53_record.interpol_red_notices_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_interpol.api_CNAME]
aws_route53_record.bundestag_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundestag.api_CNAME]
module.umweltbundesamt_api_proxy.aws_route53_record.api_domain["umweltbundesamt.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__b00f3e5ef2d342573e25d73aeb3730d2.umweltbundesamt.api.proxy.bund.dev._CNAME]
module.strahlenschutz_api_proxy.aws_route53_record.api_domain["strahlenschutz.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__23501972bd3642ae3d4654b7b855ff54.strahlenschutz.api.proxy.bund.dev._CNAME]
module.risikogebiete_api_proxy.aws_route53_record.api_domain["risikogebiete.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__a17fd9e7ac53152dfde0e8e1c6477ff1.risikogebiete.api.proxy.bund.dev._CNAME]
module.nina_api_proxy.aws_route53_record.api_domain["nina.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__d4a57c1e8aaabfe5c58e619e4136be29.nina.api.proxy.bund.dev._CNAME]
module.interpol_api_proxy.aws_route53_record.api_domain["interpol.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__4d6337f1681a7aa7e8b6e9fb8f00c87d.interpol.api.proxy.bund.dev._CNAME]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.zoll_bmf_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
aws_route53_record.status_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_status_CNAME]
module.zoll_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.bundesrat_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.smard_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.dwd_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.dwd_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 21:52:05 +0000 UTC]
module.bundestag_api_proxy.aws_route53_record.api_domain["bundestag.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__30f1b0bffddf1297f8c751ce366f4d35.bundestag.api.proxy.bund.dev._CNAME]
module.zoll_api_proxy.aws_route53_record.api_domain["zoll.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__990ad8cd70f296b8e4e9443db3b22c41.zoll.api.proxy.bund.dev._CNAME]
module.bundesrat_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:57:05 +0000 UTC]
module.smard_api_proxy.aws_route53_record.api_domain["smard.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__1b245e20906893e6c07d7a142aba0050.smard.api.proxy.bund.dev._CNAME]
module.polizei_brandenburg_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:56:49 +0000 UTC]
module.zoll_bmf_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 18:04:47 +0000 UTC]
module.lebensmittelwarnung_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-28 07:45:18 +0000 UTC]
module.strahlenschutz_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 14:13:03 +0000 UTC]
module.risikogebiete_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 20:44:50 +0000 UTC]
module.nina_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 17:43:25 +0000 UTC]
module.interpol_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:56:45 +0000 UTC]
module.umweltbundesamt_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 19:33:51 +0000 UTC]
module.bundestag_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:57:05 +0000 UTC]
module.zoll_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 18:04:35 +0000 UTC]
module.dwd_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=dwd.api.proxy.bund.dev]
module.bundesrat_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=bundesrat.api.proxy.bund.dev]
module.zoll_bmf_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=zoll-bmf.api.proxy.bund.dev]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=polizei.brandenburg.api.proxy.bund.dev]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=lebensmittelwarnung.api.proxy.bund.dev]
module.strahlenschutz_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=strahlenschutz.api.proxy.bund.dev]
module.risikogebiete_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=risikogebiete.api.proxy.bund.dev]
module.nina_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=nina.api.proxy.bund.dev]
module.interpol_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=interpol.api.proxy.bund.dev]
module.zoll_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=zoll.api.proxy.bund.dev]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=umweltbundesamt.api.proxy.bund.dev]
module.bundestag_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=bundestag.api.proxy.bund.dev]
module.dwd_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=qi65vb]
module.dwd_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_dwd.api.proxy.bund.dev_A]
module.bundesrat_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundesrat.api.proxy.bund.dev_A]
module.bundesrat_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=ksiaru]
module.zoll_bmf_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_zoll-bmf.api.proxy.bund.dev_A]
module.zoll_bmf_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=gp1ch0]
module.polizei_brandenburg_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_polizei.brandenburg.api.proxy.bund.dev_A]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=z1zi7v]
module.strahlenschutz_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_strahlenschutz.api.proxy.bund.dev_A]
module.strahlenschutz_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=6gg8vj]
module.nina_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_nina.api.proxy.bund.dev_A]
module.nina_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=n396a5]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=c5qbtc]
module.lebensmittelwarnung_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_lebensmittelwarnung.api.proxy.bund.dev_A]
module.risikogebiete_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=wiprwi]
module.risikogebiete_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_risikogebiete.api.proxy.bund.dev_A]
module.interpol_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_interpol.api.proxy.bund.dev_A]
module.interpol_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=zwef73]
module.zoll_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=fyf28z]
module.zoll_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_zoll.api.proxy.bund.dev_A]
module.umweltbundesamt_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_umweltbundesamt.api.proxy.bund.dev_A]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=ojmczx]
module.bundestag_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundestag.api.proxy.bund.dev_A]
module.bundestag_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=5ip84t]
module.smard_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 14:13:08 +0000 UTC]
module.smard_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=smard.api.proxy.bund.dev]
module.smard_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=q44v9j]
module.smard_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_smard.api.proxy.bund.dev_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_elastic_beanstalk_environment.beanstalkappenv has been changed
  ~ resource "aws_elastic_beanstalk_environment" "beanstalkappenv" {
        id                     = "e-qnmriqrttj"
        name                   = "strukturen"
        tags                   = {}
        # (15 unchanged attributes hidden)

      - setting {
          - name      = "AssociatePublicIpAddress" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "True" -> null
        }
      + setting {
          + name      = "AssociatePublicIpAddress"
          + namespace = "aws:ec2:vpc"
          + value     = "true"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      - setting {
          - name      = "ELBScheme" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "internet facing" -> null
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-role"
        }
      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "aws-elasticbeanstalk-ec2-role" -> null
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "a1.medium"
        }
      - setting {
          - name      = "InstanceType" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "a1.medium" -> null
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      - setting {
          - name      = "LoadBalancerType" -> null
          - namespace = "aws:elasticbeanstalk:environment" -> null
          - value     = "application" -> null
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      - setting {
          - name      = "MatcherHTTPCode" -> null
          - namespace = "aws:elasticbeanstalk:environment:process:default" -> null
          - value     = "200" -> null
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "4" -> null
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      - setting {
          - name      = "MinSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "1" -> null
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-245d4559,subnet-ca74d6a0"
        }
      - setting {
          - name      = "Subnets" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "subnet-ca74d6a0,subnet-245d4559" -> null
        }
      + setting {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + value     = "enhanced"
        }
      - setting {
          - name      = "SystemType" -> null
          - namespace = "aws:elasticbeanstalk:healthreporting:system" -> null
          - value     = "enhanced" -> null
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-0ee31964"
        }
      - setting {
          - name      = "VPCId" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "vpc-0ee31964" -> null
        }
    }
  # github_repository.apis_api_bund_dev_gh has been changed
  ~ resource "github_repository" "apis_api_bund_dev_gh" {
      ~ etag                   = "W/\"8b06cf4fe8ae7937f639616b2aae5cfdc1e95ec980efb1c5b5e1d23f91209677\"" -> "W/\"543f7133ac9f0cd8bca1b978761f477c192cd2b6a51ddcf376d8220a79c63061\""
        id                     = "apis"
        name                   = "apis"
        # (27 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application.elasticapp will be destroyed
  - resource "aws_elastic_beanstalk_application" "elasticapp" {
      - arn  = "arn:aws:elasticbeanstalk:eu-central-1:889551677573:application/strukturen-dev" -> null
      - id   = "strukturen-dev" -> null
      - name = "strukturen-dev" -> null
      - tags = {} -> null
    }

  # aws_elastic_beanstalk_application.strukturen_dev_app will be created
  + resource "aws_elastic_beanstalk_application" "strukturen_dev_app" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "strukturen-dev"
    }

  # aws_elastic_beanstalk_environment.beanstalkappenv will be destroyed
  - resource "aws_elastic_beanstalk_environment" "beanstalkappenv" {
      - all_settings           = [
          - {
              - name      = "AccessLogsS3Bucket"
              - namespace = "aws:elbv2:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "AccessLogsS3Enabled"
              - namespace = "aws:elbv2:loadbalancer"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "AccessLogsS3Prefix"
              - namespace = "aws:elbv2:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "AppSource"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "https://elasticbeanstalk-platform-assets-eu-central-1.s3.eu-central-1.amazonaws.com/stalks/eb_python38_amazon_linux_2_1.0.1807.0_20211116012127/sampleapp/EBSampleApp-Python.zip"
            },
          - {
              - name      = "Application Healthcheck URL"
              - namespace = "aws:elasticbeanstalk:application"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "AssociatePublicIpAddress"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "Automatically Terminate Unhealthy Instances"
              - namespace = "aws:elasticbeanstalk:monitoring"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "Availability Zones"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "Any"
            },
          - {
              - name      = "BatchSize"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "100"
            },
          - {
              - name      = "BatchSizeType"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "Percentage"
            },
          - {
              - name      = "BlockDeviceMappings"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "BreachDuration"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "ConfigDocument"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = jsonencode(
                    {
                      - CloudWatchMetrics = {
                          - Environment = {
                              - ApplicationLatencyP10    = null
                              - ApplicationLatencyP50    = null
                              - ApplicationLatencyP75    = null
                              - ApplicationLatencyP85    = null
                              - ApplicationLatencyP90    = null
                              - ApplicationLatencyP95    = null
                              - ApplicationLatencyP99    = null
                              - ApplicationLatencyP99.9  = null
                              - ApplicationRequests2xx   = null
                              - ApplicationRequests3xx   = null
                              - ApplicationRequests4xx   = null
                              - ApplicationRequests5xx   = null
                              - ApplicationRequestsTotal = null
                              - InstancesDegraded        = null
                              - InstancesInfo            = null
                              - InstancesNoData          = null
                              - InstancesOk              = null
                              - InstancesPending         = null
                              - InstancesSevere          = null
                              - InstancesUnknown         = null
                              - InstancesWarning         = null
                            }
                          - Instance    = {
                              - ApplicationLatencyP10    = null
                              - ApplicationLatencyP50    = null
                              - ApplicationLatencyP75    = null
                              - ApplicationLatencyP85    = null
                              - ApplicationLatencyP90    = null
                              - ApplicationLatencyP95    = null
                              - ApplicationLatencyP99    = null
                              - ApplicationLatencyP99.9  = null
                              - ApplicationRequests2xx   = null
                              - ApplicationRequests3xx   = null
                              - ApplicationRequests4xx   = null
                              - ApplicationRequests5xx   = null
                              - ApplicationRequestsTotal = null
                              - CPUIdle                  = null
                              - CPUIowait                = null
                              - CPUIrq                   = null
                              - CPUNice                  = null
                              - CPUSoftirq               = null
                              - CPUSystem                = null
                              - CPUUser                  = null
                              - InstanceHealth           = null
                              - LoadAverage1min          = null
                              - LoadAverage5min          = null
                              - RootFilesystemUtil       = null
                            }
                        }
                      - Version           = 1
                    }
                )
            },
          - {
              - name      = "Cooldown"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "360"
            },
          - {
              - name      = "Custom Availability Zones"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "DefaultProcess"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = "default"
            },
          - {
              - name      = "DefaultSSHPort"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "22"
            },
          - {
              - name      = "DeleteOnTerminate"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "DeleteOnTerminate"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "DeploymentPolicy"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "AllAtOnce"
            },
          - {
              - name      = "DeregistrationDelay"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "20"
            },
          - {
              - name      = "DisableIMDSv1"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EC2KeyName"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ELBScheme"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "internet facing"
            },
          - {
              - name      = "ELBSubnets"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "subnet-245d4559,subnet-ca74d6a0"
            },
          - {
              - name      = "EnableCapacityRebalancing"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EnableSpot"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EnhancedHealthAuthEnabled"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "EnvironmentType"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "LoadBalanced"
            },
          - {
              - name      = "EnvironmentVariables"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "PYTHONPATH=/var/app/venv/staging-LQM1lest/bin"
            },
          - {
              - name      = "EvaluationPeriods"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "EvaluationTime"
              - namespace = "aws:elasticbeanstalk:trafficsplitting"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ExternalExtensionsS3Bucket"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ExternalExtensionsS3Key"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "HasCoupledDatabase"
              - namespace = "aws:rds:dbinstance"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "HealthCheckInterval"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "15"
            },
          - {
              - name      = "HealthCheckPath"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "/"
            },
          - {
              - name      = "HealthCheckSuccessThreshold"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "Ok"
            },
          - {
              - name      = "HealthCheckTimeout"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "HealthStreamingEnabled"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "HealthyThresholdCount"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "3"
            },
          - {
              - name      = "HooksPkgUrl"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "https://elasticbeanstalk-platform-assets-eu-central-1.s3.eu-central-1.amazonaws.com/stalks/eb_python38_amazon_linux_2_1.0.1807.0_20211116012127/lib/hooks.tar.gz"
            },
          - {
              - name      = "IamInstanceProfile"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "aws-elasticbeanstalk-ec2-role"
            },
          - {
              - name      = "IdleTimeout"
              - namespace = "aws:elbv2:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "IgnoreHealthCheck"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "ImageId"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "ami-094b6bccbe5680e95"
            },
          - {
              - name      = "InstancePort"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "80"
            },
          - {
              - name      = "InstanceRefreshEnabled"
              - namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "InstanceType"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "a1.medium"
            },
          - {
              - name      = "InstanceTypeFamily"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "a1"
            },
          - {
              - name      = "InstanceTypes"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "a1.medium"
            },
          - {
              - name      = "LaunchTimeout"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "0"
            },
          - {
              - name      = "LaunchType"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "Migration"
            },
          - {
              - name      = "ListenerEnabled"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "LoadBalancerIsShared"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "LoadBalancerType"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "application"
            },
          - {
              - name      = "LogPublicationControl"
              - namespace = "aws:elasticbeanstalk:hostmanager"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "LowerBreachScaleIncrement"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "-1"
            },
          - {
              - name      = "LowerThreshold"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "2000000"
            },
          - {
              - name      = "ManagedActionsEnabled"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "MatcherHTTPCode"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "200"
            },
          - {
              - name      = "MaxBatchSize"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "MaxSize"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "4"
            },
          - {
              - name      = "MeasureName"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "NetworkOut"
            },
          - {
              - name      = "MinInstancesInService"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "MinSize"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "MonitoringInterval"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "5 minute"
            },
          - {
              - name      = "NewVersionPercent"
              - namespace = "aws:elasticbeanstalk:trafficsplitting"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Notification Endpoint"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Notification Protocol"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = "email"
            },
          - {
              - name      = "Notification Topic ARN"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Notification Topic Name"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "NumProcesses"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "NumThreads"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "15"
            },
          - {
              - name      = "PYTHONPATH"
              - namespace = "aws:elasticbeanstalk:application:environment"
              - resource  = ""
              - value     = "/var/app/venv/staging-LQM1lest/bin"
            },
          - {
              - name      = "PauseTime"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Period"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "Port"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "80"
            },
          - {
              - name      = "PreferredStartTime"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Protocol"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "HTTP"
            },
          - {
              - name      = "Protocol"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = "HTTP"
            },
          - {
              - name      = "ProxyServer"
              - namespace = "aws:elasticbeanstalk:environment:proxy"
              - resource  = ""
              - value     = "nginx"
            },
          - {
              - name      = "RetentionInDays"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "7"
            },
          - {
              - name      = "RetentionInDays"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "7"
            },
          - {
              - name      = "RollbackLaunchOnFailure"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "RollingUpdateEnabled"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "RollingUpdateType"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "Time"
            },
          - {
              - name      = "RootVolumeIOPS"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeSize"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeThroughput"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeType"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Rules"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SSHSourceRestriction"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "tcp,22,22,0.0.0.0/0"
            },
          - {
              - name      = "SSLCertificateArns"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SSLPolicy"
              - namespace = "aws:elbv2:listener:default"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SecurityGroups"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SecurityGroups"
              - namespace = "aws:elbv2:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ServiceRole"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "AWSServiceRoleForElasticBeanstalk"
            },
          - {
              - name      = "ServiceRoleForManagedUpdates"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SpotFleetOnDemandAboveBasePercentage"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "70"
            },
          - {
              - name      = "SpotFleetOnDemandBase"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "0"
            },
          - {
              - name      = "SpotMaxPrice"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "StaticFiles"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Statistic"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "Average"
            },
          - {
              - name      = "StickinessEnabled"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "StickinessLBCookieDuration"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "86400"
            },
          - {
              - name      = "StickinessType"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "lb_cookie"
            },
          - {
              - name      = "StreamLogs"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "Subnets"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "subnet-245d4559,subnet-ca74d6a0"
            },
          - {
              - name      = "SupportedArchitectures"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "arm64"
            },
          - {
              - name      = "SystemType"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "enhanced"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "PT30M"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "600"
            },
          - {
              - name      = "UnhealthyThresholdCount"
              - namespace = "aws:elasticbeanstalk:environment:process:default"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "Unit"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "Bytes"
            },
          - {
              - name      = "UpdateLevel"
              - namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "UpperBreachScaleIncrement"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "UpperThreshold"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "6000000"
            },
          - {
              - name      = "VPCId"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "vpc-0ee31964"
            },
          - {
              - name      = "WSGIPath"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "application"
            },
          - {
              - name      = "XRayEnabled"
              - namespace = "aws:elasticbeanstalk:xray"
              - resource  = ""
              - value     = "false"
            },
        ] -> null
      - application            = "strukturen-dev" -> null
      - arn                    = "arn:aws:elasticbeanstalk:eu-central-1:889551677573:environment/strukturen-dev/strukturen" -> null
      - autoscaling_groups     = [
          - "awseb-e-qnmriqrttj-stack-AWSEBAutoScalingGroup-MHCXURFHA9LH",
        ] -> null
      - cname                  = "strukturen.eba-zpdqhhf7.eu-central-1.elasticbeanstalk.com" -> null
      - endpoint_url           = "awseb-AWSEB-1JHQ1MZOWM84F-1224103337.eu-central-1.elb.amazonaws.com" -> null
      - id                     = "e-qnmriqrttj" -> null
      - instances              = [
          - "i-05a22765c6d68a790",
        ] -> null
      - launch_configurations  = [
          - "awseb-e-qnmriqrttj-stack-AWSEBAutoScalingLaunchConfiguration-VcRiRG6acSDC",
        ] -> null
      - load_balancers         = [
          - "arn:aws:elasticloadbalancing:eu-central-1:889551677573:loadbalancer/app/awseb-AWSEB-1JHQ1MZOWM84F/d2188b16443de83f",
        ] -> null
      - name                   = "strukturen" -> null
      - platform_arn           = "arn:aws:elasticbeanstalk:eu-central-1::platform/Python 3.8 running on 64bit Amazon Linux 2/3.3.8" -> null
      - queues                 = [] -> null
      - solution_stack_name    = "64bit Amazon Linux 2 v3.3.8 running Python 3.8" -> null
      - tags                   = {} -> null
      - tier                   = "WebServer" -> null
      - triggers               = [] -> null
      - wait_for_ready_timeout = "20m" -> null

      - setting {
          - name      = "AssociatePublicIpAddress" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "true" -> null
        }
      - setting {
          - name      = "ELBScheme" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "internet facing" -> null
        }
      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "aws-elasticbeanstalk-ec2-role" -> null
        }
      - setting {
          - name      = "InstanceType" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "a1.medium" -> null
        }
      - setting {
          - name      = "LoadBalancerType" -> null
          - namespace = "aws:elasticbeanstalk:environment" -> null
          - value     = "application" -> null
        }
      - setting {
          - name      = "MatcherHTTPCode" -> null
          - namespace = "aws:elasticbeanstalk:environment:process:default" -> null
          - value     = "200" -> null
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "4" -> null
        }
      - setting {
          - name      = "MinSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "1" -> null
        }
      - setting {
          - name      = "Subnets" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "subnet-245d4559,subnet-ca74d6a0" -> null
        }
      - setting {
          - name      = "SystemType" -> null
          - namespace = "aws:elasticbeanstalk:healthreporting:system" -> null
          - value     = "enhanced" -> null
        }
      - setting {
          - name      = "VPCId" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "vpc-0ee31964" -> null
        }
    }

  # aws_elastic_beanstalk_environment.strukturen_dev_env will be created
  + resource "aws_elastic_beanstalk_environment" "strukturen_dev_env" {
      + all_settings           = (known after apply)
      + application            = "strukturen-dev"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "strukturen"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.3.8 running Python 3.8"
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "AssociatePublicIpAddress"
          + namespace = "aws:ec2:vpc"
          + value     = "True"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-role"
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "a1.medium"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-ca74d6a0,subnet-245d4559"
        }
      + setting {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + value     = "enhanced"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-0ee31964"
        }
    }

  # aws_route53_record.api_beta_strukturen_bund_dev will be created
  + resource "aws_route53_record" "api_beta_strukturen_bund_dev" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.beta.strukturen"
      + type            = "A"
      + zone_id         = "Z01225332CR1A1YNN1OLS"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = "Z1FRNW7UH4DEZJ"
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.


```
</details>
*Pusher: @LilithWittmann, Action: `pull_request`*